package exam;

public class MathRandomEx {
	
//	* 랜덤(random)함수 = 무작위함수 = 난수
//			--> 0.0 <= Math.random() < 1.0 //0.0 ~ 0.9
//
//			※ 아래 제시한 임의의 난수를 생성하는 랜덤함수를 정의하여 보시오. 
//			아래의 문제를 풀고 규칙을 찾아내어 이해하세요!
//
//			문제1. 0부터 9까지 임의의 난수 생성  ==> (int)(math.random()*10)
//			문제2. 1부터 10까지 임의의 난수 생성 ==> (int)(math.random()*10)+1
//			문제3. 1부터 100까지 임의의 난수 생성 ==> (int)(math.random()*100)+1
//			문제4. 100부터 500까지 임의의 난수 생성 ==> (int)(math.random()*401)+100
//			문제5. 151부터 200까지 임의의 난수 생성 ==> (int)(math.random()*50)+151
//			문제6. 50부터 100까지 임의의 난수 생성  ==> (int)(math.random()*51)+50
//			문제7. 0부터 100까지 임의의 난수 생성 ==> (int)(math.random()*101)
//			문제8. 0부터 99까지 임의의 난수 생성  ==> (int)(math.random()*100)
//			문제9. 1부터 45까지 임의의 난수 생성  ==> (int)(math.random()*45)+1
//			문제10. 1부터 3까지 임의의 난수 생성 ==> (int)(math.random()*3)+1
//			문제11. 11부터 15까지 임의의 난수 생성 ==> (int)(math.random()*5)+11
//			문제12. 1000부터 1200까지 임의의 난수 생성 ==> (int)(math.random()*201)+1000
//			문제13. 200부터 350까지 임의의 난수 생성 ==> (int)(math.random()*151)+200
//			문제14. 10부터 20까지 임의의 난수 생성 ==> (int)(math.random()*11)+10
//			문제15. 900부터 999까지 임의의 난수 생성 ==> (int)(math.random()*100)+900
//			문제16. 500부터 600까지 임의의 난수 생성 ==> (int)(math.random()*101)+500
//			문제17. 1부터 15까지 임의의 난수 생성 ==> (int)(math.random()*15)+1
//			문제18. 31부터 50까지 임의의 난수 생성 ==> (int)(math.random()*20)+31
//			문제19. 1001부터 2000까지 임의의 난수 생성  ==> (int)(math.random()*1000)+1001
//			문제20. 0부터 2까지 임의의 난수 생성  ==> (int)(math.random()*3)

}
